tutorials/suspensionFoam/RAS/MUSTE/MUSTE_NBS1/Allrun
#!/bin/sh

# Create the mesh
blockMesh

# create the intial time folder
cp -r 0_org 0

# Run suspensionFoam
suspensionFoam > log&

funkySetFields -time 0:
